In [1]:
pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.3-cp310-cp310-win_amd64.whl (1.2 MB)
     ---------------------------------------- 1.2/1.2 MB 2.7 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.3
Note: you may need to restart the kernel to use updated packages.

In [32]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.9-py2.py3-none-any.whl (242 kB)
     -------------------------------------- 242.2/242.2 KB 1.7 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.9
Note: you may need to restart the kernel to use updated packages.

In [5]:
pip install pandas

Collecting pandas
  Downloading pandas-1.4.0-cp310-cp310-win_amd64.whl (10.6 MB)
     ---------------------------------------- 10.6/10.6 MB 3.2 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\riyad\myenv\lib\site-packages (from pandas) (2.8.2)
Collecting numpy>=1.21.0
  Downloading numpy-1.22.2-cp310-cp310-win_amd64.whl (14.7 MB)
     ---------------------------------------- 14.7/14.7 MB 3.0 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading pytz-2021.3-py2.py3-none-any.whl (503 kB)
     -------------------------------------- 503.5/503.5 KB 2.4 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\riyad\myenv\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.22.2 pandas-1.4.0 pytz-2021.3
Note: you may need to restart the kernel to use updated packages.

# Loading Libraries

In [106]:
import warnings
warnings.filterwarnings("ignore")

import psycopg2
import psycopg2.extras
import pandas as pd

# Database connection

In [111]:


class PostgresConnect(object):
    def __init__(self):
        self.connection = psycopg2.connect(database = "ecomdb",
                                          user = "postgres",
                                          password = "12345678",
                                          host = "",
                                          port = "5432"
                                          )
    
    def getConnection(self):
        print("Successfully connected to database")
        return self.connection

In [112]:
con = PostgresConnect().getConnection()

Successfully connected to database

# Extract

In [9]:
DATA_DIR = "F:\Health Data Analytics\Ecom Data"

In [14]:
#trans_dim = pd.read_excel(open(DATA_DIR + 'e-commerece_data.xlsx', 'rb'), sheet_name = 1, engine = 'openpyxl')

### Customer Data

In [91]:
customer_df = pd.read_csv("C:/Users/Riyad/Desktop/ecomdata/Coustomer_dim.csv")
customer_df.head()

  coustomer_key             name    contact_no           nid
0       C000001            sumit  8.801920e+12  7.505080e+12
1       C000002         tammanne  8.801817e+12  1.977730e+12
2       C000003    kailash kumar  8.801660e+12  3.769490e+12
3       C000004  bhagwati prasad  8.801534e+12  9.378830e+12
4       C000005             ajay  8.801944e+12  3.540820e+12

In [92]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9191 entries, 0 to 9190
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   coustomer_key  9191 non-null   object
 1   name           9164 non-null   object
 2   contact_no     9191 non-null   float64
 3   nid            9191 non-null   float64
dtypes: float64(2), object(2)
memory usage: 287.3+ KB

In [93]:
customer_df.isnull().sum()

coustomer_key     0
name             27
contact_no        0
nid               0
dtype: int64

In [96]:
customer_df1 = customer_df.dropna()
print(customer_df1.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9164 entries, 0 to 9190
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   coustomer_key  9164 non-null   object
 1   name           9164 non-null   object
 2   contact_no     9164 non-null   float64
 3   nid            9164 non-null   float64
dtypes: float64(2), object(2)
memory usage: 358.0+ KB
None

In [97]:
customer_df1.head()

  coustomer_key             name    contact_no           nid
0       C000001            sumit  8.801920e+12  7.505080e+12
1       C000002         tammanne  8.801817e+12  1.977730e+12
2       C000003    kailash kumar  8.801660e+12  3.769490e+12
3       C000004  bhagwati prasad  8.801534e+12  9.378830e+12
4       C000005             ajay  8.801944e+12  3.540820e+12

In [98]:
customer_df1["contact_no"] = customer_df1["contact_no"].astype("Int64")

In [99]:
customer_df1["nid"] =  customer_df1["nid"].astype("Int64")

In [100]:
customer_df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9164 entries, 0 to 9190
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   coustomer_key  9164 non-null   object
 1   name           9164 non-null   object
 2   contact_no     9164 non-null   Int64
 3   nid            9164 non-null   Int64
dtypes: Int64(2), object(2)
memory usage: 375.9+ KB

In [101]:
customer_df1.head()

  coustomer_key             name     contact_no            nid
0       C000001            sumit  8801920000000  7505080000000
1       C000002         tammanne  8801817069329  1977730000000
2       C000003    kailash kumar  8801660000000  3769490000000
3       C000004  bhagwati prasad  8801533627961  9378830000000
4       C000005             ajay  8801943715786  3540820000000

### Transaction data

In [49]:
trans_df = pd.read_csv("C:/Users/Riyad/Desktop/ecomdata/Trans_dim.csv")
trans_df.head()

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

In [59]:
trans_df["payment_key"] == "S00307"

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
Name: payment_key, dtype: bool

In [50]:
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   payment_key  39 non-null     object
 1   trans_type   39 non-null     object
 2   bank_name    39 non-null     object
dtypes: object(3)
memory usage: 1.0+ KB

### Item data

In [111]:
item_df = pd.read_csv("Item_dim.csv")
item_df.head()

,item_key,item_name,desc,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans

In [112]:
item_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_key     264 non-null    object
 1   item_name    264 non-null    object
 2   desc         264 non-null    object
 3   unit_price   264 non-null    float64
 4   man_country  264 non-null    object
 5   supplier     264 non-null    object
 6   unit         263 non-null    object
dtypes: float64(1), object(6)
memory usage: 14.6+ KB

In [113]:
item_df.dropna(inplace = True)

In [115]:
print(item_df.isnull().sum())
print(item_df.info())

item_key       0
item_name      0
desc           0
unit_price     0
man_country    0
supplier       0
unit           0
dtype: int64
<class 'pandas.core.frame.DataFrame'>
Int64Index: 263 entries, 0 to 263
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_key     263 non-null    object
 1   item_name    263 non-null    object
 2   desc         263 non-null    object
 3   unit_price   263 non-null    float64
 4   man_country  263 non-null    object
 5   supplier     263 non-null    object
 6   unit         263 non-null    object
dtypes: float64(1), object(6)
memory usage: 16.4+ KB
None

## Store Data

In [62]:
store_df = pd.read_csv("C:/Users/Riyad/Desktop/ecomdata/Store_dim.csv")
store_df.head()

  store_key division  district         upazila
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ
1     S0002   SYLHET  HABIGANJ         BAHUBAL
2     S0003   SYLHET  HABIGANJ      BANIACHONG
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR

In [12]:
store_df.columns

Index(['store_key', 'division', 'district', 'upazila'], dtype='object')

In [63]:
store_df[store_df["store_key"] == "S00307"]

    store_key division  district   upazila
306    S00307    DHAKA  JAMALPUR  ISLAMPUR

In [14]:
store_df.dtypes

store_key    object
division     object
district     object
upazila      object
dtype: object

In [15]:
store_df.isnull().sum()

store_key    0
division     0
district     0
upazila      0
dtype: int64

### Time dim

In [23]:
time_df = pd.read_csv("C:/Users/Riyad/Desktop/ecomdata/Time_dim.csv")
time_df.head()

  time_key              date  hour  day      week  month quarter  year
0   T00001  20-05-2017 14:56    14   20  3rd Week      5      Q2  2017
1   T00002  30-01-2015 22:14    22   30  4th Week      1      Q1  2015
2   T00003  14-03-2020 02:34     2   14  2nd Week      3      Q1  2020
3   T00004  27-04-2018 12:19    12   27  4th Week      4      Q2  2018
4   T00005  14-04-2018 10:43    10   14  2nd Week      4      Q2  2018

In [24]:
time_df.isnull().sum()

time_key    0
date        0
hour        0
day         0
week        0
month       0
quarter     0
year        0
dtype: int64

In [25]:
# time_df['date'] = time_df['date'].astype('datetime64[ns]')

In [26]:
time_df["date"] =  pd.to_datetime(time_df["date"], format = '%d-%m-%Y %H:%M')

In [27]:
time_df.head()

  time_key                date  hour  day      week  month quarter  year
0   T00001 2017-05-20 14:56:00    14   20  3rd Week      5      Q2  2017
1   T00002 2015-01-30 22:14:00    22   30  4th Week      1      Q1  2015
2   T00003 2020-03-14 02:34:00     2   14  2nd Week      3      Q1  2020
3   T00004 2018-04-27 12:19:00    12   27  4th Week      4      Q2  2018
4   T00005 2018-04-14 10:43:00    10   14  2nd Week      4      Q2  2018

In [28]:
#df_time_dim['date'] = pd.to_datetime(df_time_dim['date'], format='%d-%m-%Y %H:%M')

In [29]:
time_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99999 entries, 0 to 99998
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time_key  99999 non-null  object
 1   date      99999 non-null  datetime64[ns]
 2   hour      99999 non-null  int64
 3   day       99999 non-null  int64
 4   week      99999 non-null  object
 5   month     99999 non-null  int64
 6   quarter   99999 non-null  object
 7   year      99999 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(3)
memory usage: 6.1+ MB

### Fact Data

In [84]:
fact_df = pd.read_excel(r'C:/Users/Riyad/Desktop/ecomdata/e-commerece_data.xlsx', sheet_name='Fact_table', engine='openpyxl')
fact_df.head()

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0
3,P032,C007048,T084631,I00131,S0086,8,ct,14.0,112.0
4,P014,C006430,T071276,I00050,S00488,8,cans,8.0,64.0

In [107]:
fact_df1 = pd.read_csv("C:/Users/Riyad/Desktop/ecomdata/e-commerece_data.csv")
fact_df1.head()

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0
3,P032,C007048,T084631,I00131,S0086,8,ct,14.0,112.0
4,P014,C006430,T071276,I00050,S00488,8,cans,8.0,64.0

In [108]:
fact_df1[fact_df1["store_key"] == "S00307"]

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0
976,P006,C005776,T061413,I00038,S00307,11,bottles,23.0,253.0
2544,P033,C008998,T013653,I00233,S00307,11,ct,12.0,132.0
2812,P019,C005310,T049849,I00232,S00307,9,ct,12.0,108.0
3690,P005,C003847,T010845,I00047,S00307,7,cans,8.0,56.0
...,...,...,...,...,...,...,...,...,...
997793,P020,C001564,T054695,I00095,S00307,2,botlltes,16,32.0
997983,P018,C007051,T043298,I00210,S00307,1,ct,15,15.0
999386,P025,C003798,T089015,I00114,S00307,8,ct,44,352.0
999430,P018,C003830,T031200,I00183,S00307,3,ct,35,105.0
999596,P036,C008580,T028691,I00056,S00307,10,bottles,24,240.0

In [109]:
fact_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1110224 entries, 0 to 1110223
Data columns (total 9 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   payment_key    1110224 non-null  object
 1   coustomer_key  1110197 non-null  object
 2   time_key       1110224 non-null  object
 3   item_key       1110184 non-null  object
 4   store_key      1100265 non-null  object
 5   quantity       1100265 non-null  object
 6   unit           1096541 non-null  object
 7   unit_price     1100000 non-null  object
 8   total_price    1000000 non-null  float64
dtypes: float64(1), object(8)
memory usage: 76.2+ MB

In [110]:
fact_df.dropna(inplace = True)
fact_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 996277 entries, 0 to 999999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   payment_key    996277 non-null  object
 1   coustomer_key  996277 non-null  object
 2   time_key       996277 non-null  object
 3   item_key       996277 non-null  object
 4   store_key      996277 non-null  object
 5   quantity       996277 non-null  int64
 6   unit           996277 non-null  object
 7   unit_price     996277 non-null  float64
 8   total_price    996277 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 76.0+ MB

# Transform

# Load

### Customer Data Load to postgre

In [104]:
#Customer table 
query_customer = "INSERT INTO public.customer_dim(cutomer_key,name,contact_no,nid)"\
                    "VALUES (%s,%s,%s,%s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur,query_customer, customer_df1.values)
con.commit()
cur.close()

### Transaction data load to postgre

In [51]:
query_transaction = "INSERT INTO public.trans_dim ( payment_key, trans_type, bank_name)" \
            " VALUES (%s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, query_transaction, trans_df.values)
con.commit()
cur.close()

### Item Data to postgre

In [124]:
query_item = "INSERT INTO public.item_dim (item_key, item_name, descri, unit_price, man_country, supplier, unit)"\
              "VALUES (%s, %s, %s, %s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, query_item, item_df.values)
con.commit()
cur.close()

### Store Data Load to Postgre

In [21]:
query_store = "INSERT INTO public.store_dim (store_key, division, district, upazila)"\
             "VALUES (%s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, query_store, store_df.values)
con.commit()
cur.close()

### Time Dim data to Postgre

In [30]:
query_time = "INSERT INTO public.time_dim (time_key, date, hour, day, week, month, quarter, year)"\
             "VALUES (%s, %s, %s, %s, %s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, query_time, time_df.values)
con.commit()
cur.close()

### Fact Table to postgre

In [113]:
query_fact = "INSERT INTO public.fact_table(payment_key, cutomer_key, time_key, item_key, store_key, quantity,unit, unit_price, total_price)"\
               "VALUES(%s, %s, %s, %s,%s, %s, %s, %s, %s)"
cur  = con.cursor()
psycopg2.extras.execute_batch(cur, query_fact, fact_df.values)
con.commit()
cur.close()

In [ ]:
insert_stmt = "INSERT INTO star_schema.fact_table(payment_key, customer_key, time_key, item_key, store_key, quantity, unit, unit_price, total_price)VALUE